app/controllers/cities_controller.rb

  def create
    @city = City.new(city_params)

    respond_to do |format|
      if @city.save
---
INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Tokyo"], ["created_at", "2017-11-03 15:31:24.270047"], ["updated_at", "2017-11-03 15:31:24.270047"]]

  def update
    respond_to do |format|
      if @city.update(city_params)
---
UPDATE "cities" SET "name" = $1, "updated_at" = $2 WHERE "cities"."id" = $3  [["name", "New York City"], ["updated_at", "2017-11-03 15:31:57.287588"], ["id", 4]]