app/controllers/foos_controller.rb

SELECT "foos".* FROM "foos"
---
  def index
    @foos = Foo.all

INSERT INTO "foos" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test1"], ["created_at", "2017-11-02 23:02:57.414046"], ["updated_at", "2017-11-02 23:02:57.414046"]]
---
  def create
    @foo = Foo.new(foo_params)

    respond_to do |format|
      if @foo.save

UPDATE "foos" SET "name" = $1, "updated_at" = $2 WHERE "foos"."id" = $3  [["name", "test1"], ["updated_at", "2017-11-02 23:02:35.697505"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @foo.update(foo_params)

DELETE FROM "foos" WHERE "foos"."id" = $1  [["id", 6]]
---
  def destroy
    @foo.destroy

SELECT  "foos".* FROM "foos" WHERE "foos"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_foo
      @foo = Foo.find(params[:id])